{
  "2.4.2": {
    "en": "Add support for the Heatit Z-Push Button 4 devices"
  },
  "2.5.0": {
    "en": "Add support for the Z-TRM3 thermostat and meter reset action for applicable devices"
  },
  "2.5.1": {
    "en": "Fix Z-Dim device driver crashing on init"
  },
  "2.6.0": {
    "en": "Add support for the Heatit Z-TEMP2 thermostat"
  },
  "2.6.1": {
    "en": "Add support for the Heatit Z-TEMP2 thermostat device"
  },
  "2.7.0": {
    "en": "Add support for the Z-Smoke AC Smoke Detector"
  },
  "2.7.1": {
    "en": "Fix Z-TRM3 communication / association issues"
  },
  "3.0.0": {
    "en": "Update to Homey SDKv3"
  },
  "3.4.2": {
    "en": "Added support for Heatit Z-Smoke Battery on Homey Bridge"
  },
  "3.6.3": {
    "en": "Added support for floor and external temperature sensor for Z-TRM6. Added support for temperature sensors for Z-Water2. Removed wrong parameter for Z-Han/B."
  },
  "3.6.4": {
    "en": "Added support for floor and external temperature sensor for Z-TRM6. Added support for temperature sensors for Z-Water2. Removed wrong parameter for Z-HAN/B."
  },
  "3.8.7": {
    "en": "Added Z-TRM6 polling for test, Added status indicator option for ZTEMP2 and ZTEMP3 for test."
  },
  "3.9.0": {
    "en": "Reduces reports from Z-TRM6"
  },
  "3.9.1": {
    "en": "Minor bug fixes"
  },
  "3.9.2": {
    "en": "Change Z-TEMP3 class to \"thermostat\" from \"other\""
  },
  "3.9.3": {
    "en": "Update Z-Han/Z-Han2"
  },
  "3.9.4": {
    "en": "Fixed ZM-Thermostat driver"
  },
  "3.9.5": {
    "en": "Fixed onoff on ZM-Thermostat. Fixed Z-TRM6 showing incorrect sensor in Setpoint UI. Added onoff on Z-TEMP3."
  },
  "3.9.8": {
    "en": "Fixed persistance in Measure_temperature on TRM6 and TRM6 DC."
  },
  "3.9.9": {
    "en": "Changed TRM6 code and a lot of other small changes to reduce errors"
  },
  "3.9.10": {
    "en": "Capability changes TRM6"
  },
  "4.0.0": {
    "en": "Added support Heatit WiFi6 and WiFi Panel"
  },
  "4.0.1": {
    "en": "Updated TRM6 driver, added Powerregulator. Updated WiFi integrations."
  },
  "4.0.2": {
    "en": "Add Cumulative for HAN/HAN B"
  }
}
